comp-sci/literate-programming/whither.org
#+TITLE: Bob Meyer's "Whither Literate Programming"
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2024-05-27T15:22:31-07:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
# Created Monday May 27, 2024 at  3:22PM

This is just my copy of Bob Myers's series of posts "Whither Literate
Programming"
([[https://torazaburo.medium.com/whither-literate-programming-2-what-went-wrong-e4a3d89af644][Part 2]], [[https://torazaburo.medium.com/whither-literate-programming-3-desiderata-for-a-new-era-b3cc8e19d441][Part 3]]),
since Medium has decided to obfuscate and hide it. Since it seems to be
paywalled, I'm just noting it for myself.

* Whither Literate Programming (1)
:PROPERTIES:
:CUSTOM_ID: h-cbea2488-7f3a-4fa7-8dc5-ec37553f6a87
:END:

It’s been more than three decades since literate programming was
invented by the legendary Donald Knuth. Its promise was immense —
creating software which was more reliable, more understandable, more
maintainable, and with hugely more teaching value — software which
targeted /both/ humans /and/ computers.

What is literate programming? How has literate programming evolved? Why
hasn’t literate programming taken off? Where is it headed?

In this three-part series, we’ll take a detailed look at these
questions. This first part is an introduction to what is literate
programming. (The second part, an overview of the challenges with
literate programming, is here.)

** What is literate programming?
:PROPERTIES:
:CUSTOM_ID: h-c1eb4c1f-b1b9-4836-adce-948b43c8cacc
:END:

Let’s define literate programming.

#+begin_quote
Literate programming refers to melding a descriptive narrative and
computer code into a single document, from which both human-friendly
documentation and computer-readable files can be created.
#+end_quote

Let us quote from Knuth’s [[http://www.literateprogramming.com/knuthweb.pdf][paper on literate programming]]:

#+begin_quote
The practitioner of literate programming can be regarded as an essayist,
whose main concern is with exposition and excellence of style. Such an
author, with thesaurus in hand, chooses the names of variables carefully
and explains what each variable means. He or she strives for a program
that is comprehensible because its concepts have been introduced in an
order that is best for human understanding, using a mixture of formal
and informal methods that reınforce each other.
#+end_quote

As Knuth says, the document does not have to, and in fact probably
should not, follow the lexical order of the source code, whatever that
is; instead, the whole idea is that its order should be most meaningful
to human readers (he calls this the “stream of consciousness”
order). The process of creating the document is called *weaving*; the
process of creating the compilable files is called *tangling*.


In a 2008 interview, Knuth also claims increased productivity as well as
more happiness:

#+begin_quote
Not only has it enabled me to write and maintain programs *faster* and
more reliably than ever before, and been one of my greatest sources of
*joy* since the 1980s — it has actually been indispensable at times.
#+end_quote

** Recent LP works
:PROPERTIES:
:CUSTOM_ID: h-999d5b14-5507-48f7-917a-2ce253121413
:END:

In addition to various works published by Knuth in what he called WEB,
his initial implementation of literate programming, there are several
outstanding examples of literate programming. Perhaps the most ambitious
is the CGI book called [[https://www.amazon.com/Physically-Based-Rendering-Theory-Implementation/dp/0128006455][“Physically Based Rendering”]] by Pharr and
Humphreys, which is famous for being the only book ever to have won an
Academy Award (Knuth said it should have also won a Pulitzer):

Other books cited as great examples of literate programming style
include [[https://www.amazon.com/Interfaces-Implementations-Techniques-Creating-Reusable/dp/0201498413/ref=sr_1_1?ie=UTF8&qid=1535698536][“C Interfaces and Implementations”]] by David R. Hanson:

The book [[https://www.amazon.com/Lisp-Small-Pieces-Christian-Queinnec/dp/0521545668][“Lisp in Small Pieces”]] is sometimes cited as an example of
literate programming, but it seems to really be narrative interspersed
with code fragments for didactic purposes.

One [[https://news.ycombinator.com/item?id=10070549][post in a Hacker News thread]] from three years ago described the
thorough-going use of literate programming at a major defense
contractor, with excellent results. He notes:

#+begin_quote
It forced us to keep things clean, modular and simple. It meant doing
everything took longer the first time, but at the point of actually
writing the code, the coder had a really good picture of exactly what it
had to do and exactly where it fitted in to the grander scheme. There
was little revisiting or rewriting, and usually the first version
written was the last version written. It also made debugging a lot
easier.
#+end_quote

** What is NOT literate programming?
:PROPERTIES:
:CUSTOM_ID: h-b631271d-8883-4687-bc23-74835864db12
:END:

In this section, we review various alternatives and point out why they
are /not/ literate programming in the strict sense of the word.

