docs/comp-sci/literate-programming/whither.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bob Meyer's "Whither Literate Programming"</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Bob Meyer's "Whither Literate Programming"</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-cbea2488-7f3a-4fa7-8dc5-ec37553f6a87">1. Whither Literate Programming (1)</a>
<ul>
<li><a href="#h-c1eb4c1f-b1b9-4836-adce-948b43c8cacc">1.1. What is literate programming?</a></li>
<li><a href="#h-999d5b14-5507-48f7-917a-2ce253121413">1.2. Recent LP works</a></li>
<li><a href="#h-b631271d-8883-4687-bc23-74835864db12">1.3. What is NOT literate programming?</a>
<ul>
<li><a href="#h-9c07e10d-f7b5-4373-bfd3-75086c32c23d">1.3.1. Docco</a></li>
<li><a href="#h-903c6781-ed3f-4b77-80b5-2fabf264eb23">1.3.2. Jupyter</a></li>
<li><a href="#h-c90aa9b5-87a0-4457-b3f9-01cb4c6cd7b7">1.3.3. JSDoc</a></li>
<li><a href="#h-5206c1ad-a465-4477-ae97-6ff2d4b90220">1.3.4. Literate CoffeeScript and Literate Haskell</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#h-f3297cfd-2970-4f6d-8400-71c8f6e79063">2. Whither Literate Programming (2) — What went wrong?</a>
<ul>
<li><a href="#h-0b6713f2-af64-4189-8507-5b5de0c041d6">2.1. It solves problems that don’t need to be solved anymore</a></li>
<li><a href="#h-cf3c2b25-b181-4205-ba41-742b5db5b197">2.2. Literate programming is too much work and/or not necessary</a></li>
<li><a href="#h-adf8b1ca-44e4-4935-9be8-6d7dd267a16c">2.3. I don’t need no stinking comments</a></li>
<li><a href="#h-9a403545-32fc-45c1-b99e-18532c065ae0">2.4. IDEs</a></li>
<li><a href="#h-433ccf98-b471-4cfd-91ec-258b3a419a1c">2.5. Tooling</a></li>
<li><a href="#h-e0f4e384-0e7f-4f70-b3b1-0e63adae87c3">2.6. Literate revision management</a></li>
<li><a href="#h-575501da-22db-4b61-a10b-ebda3548b6ae">2.7. Modern features in programming languages</a></li>
<li><a href="#h-d4f8f65a-725b-4f5e-918e-fbfb13bc1651">2.8. Test-Driven Development</a></li>
<li><a href="#h-0258b0c0-1c9c-4f19-88ad-39437fea1529">2.9. Speed of change</a></li>
<li><a href="#h-5cd1ac68-a2fa-403a-8f59-efd853925918">2.10. Agility</a></li>
<li><a href="#h-c3b4a393-edb6-4e63-a8f5-64c5212ea32c">2.11. The demise of program design</a></li>
<li><a href="#h-073a1c5c-1f50-49fb-a39e-c4b2b458585a">2.12. A modular world</a></li>
<li><a href="#h-fa9d0067-ebe4-42d0-a69f-c36761a2dace">2.13. Moving ahead</a></li>
</ul>
</li>
<li><a href="#h-c7f91692-80ff-4392-9c2a-3c8f5d48c1fd">3. Whither Literate Programming (3) — Desiderata for a New Era</a>
<ul>
<li><a href="#h-ad821979-f375-42ab-bb8a-f760bd1113e7">3.1. What is literate programming?</a></li>
<li><a href="#h-6f2438f9-d72d-42da-bf96-eb8c5d53b6ea">3.2. How must literate programming be reinvented?</a></li>
<li><a href="#h-0b6833fe-bc8d-49bf-bacb-c7735e20386f">3.3. A medium for literate programming for the 2020s</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This is just my copy of Bob Myers's series of posts "Whither Literate
Programming"
(<a href="https://torazaburo.medium.com/whither-literate-programming-2-what-went-wrong-e4a3d89af644">Part 2</a>, <a href="https://torazaburo.medium.com/whither-literate-programming-3-desiderata-for-a-new-era-b3cc8e19d441">Part 3</a>),
since Medium has decided to obfuscate and hide it. Since it seems to be
paywalled, I'm just noting it for myself.
</p>
<div id="outline-container-h-cbea2488-7f3a-4fa7-8dc5-ec37553f6a87" class="outline-2">
<h2 id="h-cbea2488-7f3a-4fa7-8dc5-ec37553f6a87"><span class="section-number-2">1.</span> Whither Literate Programming (1)</h2>
<div class="outline-text-2" id="text-h-cbea2488-7f3a-4fa7-8dc5-ec37553f6a87">
<p>
It’s been more than three decades since literate programming was
invented by the legendary Donald Knuth. Its promise was immense —
creating software which was more reliable, more understandable, more
maintainable, and with hugely more teaching value — software which
targeted <i>both</i> humans <i>and</i> computers.
</p>

<p>
What is literate programming? How has literate programming evolved? Why
hasn’t literate programming taken off? Where is it headed?
</p>

<p>
In this three-part series, we’ll take a detailed look at these
questions. This first part is an introduction to what is literate
programming. (The second part, an overview of the challenges with
literate programming, is here.)
</p>
</div>
<div id="outline-container-h-c1eb4c1f-b1b9-4836-adce-948b43c8cacc" class="outline-3">
<h3 id="h-c1eb4c1f-b1b9-4836-adce-948b43c8cacc"><span class="section-number-3">1.1.</span> What is literate programming?</h3>
<div class="outline-text-3" id="text-h-c1eb4c1f-b1b9-4836-adce-948b43c8cacc">
<p>
Let’s define literate programming.
</p>

<blockquote>
<p>
Literate programming refers to melding a descriptive narrative and
computer code into a single document, from which both human-friendly
documentation and computer-readable files can be created.
</p>
</blockquote>

<p>
Let us quote from Knuth’s <a href="http://www.literateprogramming.com/knuthweb.pdf">paper on literate programming</a>:
</p>

<blockquote>
<p>
The practitioner of literate programming can be regarded as an essayist,
whose main concern is with exposition and excellence of style. Such an
author, with thesaurus in hand, chooses the names of variables carefully
and explains what each variable means. He or she strives for a program
that is comprehensible because its concepts have been introduced in an
order that is best for human understanding, using a mixture of formal
and informal methods that reınforce each other.
</p>
</blockquote>

<p>
As Knuth says, the document does not have to, and in fact probably
should not, follow the lexical order of the source code, whatever that
is; instead, the whole idea is that its order should be most meaningful
to human readers (he calls this the “stream of consciousness”
order). The process of creating the document is called <b>weaving</b>; the
process of creating the compilable files is called <b>tangling</b>.
</p>


<p>
In a 2008 interview, Knuth also claims increased productivity as well as
more happiness:
</p>

<blockquote>
<p>
Not only has it enabled me to write and maintain programs <b>faster</b> and
more reliably than ever before, and been one of my greatest sources of
<b>joy</b> since the 1980s — it has actually been indispensable at times.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-h-999d5b14-5507-48f7-917a-2ce253121413" class="outline-3">
<h3 id="h-999d5b14-5507-48f7-917a-2ce253121413"><span class="section-number-3">1.2.</span> Recent LP works</h3>
<div class="outline-text-3" id="text-h-999d5b14-5507-48f7-917a-2ce253121413">
<p>
In addition to various works published by Knuth in what he called WEB,
his initial implementation of literate programming, there are several
outstanding examples of literate programming. Perhaps the most ambitious
is the CGI book called <a href="https://www.amazon.com/Physically-Based-Rendering-Theory-Implementation/dp/0128006455">“Physically Based Rendering”</a> by Pharr and
Humphreys, which is famous for being the only book ever to have won an
Academy Award (Knuth said it should have also won a Pulitzer):
</p>

<p>
Other books cited as great examples of literate programming style
include <a href="https://www.amazon.com/Interfaces-Implementations-Techniques-Creating-Reusable/dp/0201498413/ref=sr_1_1?ie=UTF8&amp;qid=1535698536">“C Interfaces and Implementations”</a> by David R. Hanson:
</p>

<p>
The book <a href="https://www.amazon.com/Lisp-Small-Pieces-Christian-Queinnec/dp/0521545668">“Lisp in Small Pieces”</a> is sometimes cited as an example of
literate programming, but it seems to really be narrative interspersed
with code fragments for didactic purposes.
</p>

<p>
One <a href="https://news.ycombinator.com/item?id=10070549">post in a Hacker News thread</a> from three years ago described the
thorough-going use of literate programming at a major defense
contractor, with excellent results. He notes:
</p>

<blockquote>
<p>
It forced us to keep things clean, modular and simple. It meant doing
everything took longer the first time, but at the point of actually
writing the code, the coder had a really good picture of exactly what it
had to do and exactly where it fitted in to the grander scheme. There
was little revisiting or rewriting, and usually the first version
written was the last version written. It also made debugging a lot
easier.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-h-b631271d-8883-4687-bc23-74835864db12" class="outline-3">
<h3 id="h-b631271d-8883-4687-bc23-74835864db12"><span class="section-number-3">1.3.</span> What is NOT literate programming?</h3>
<div class="outline-text-3" id="text-h-b631271d-8883-4687-bc23-74835864db12">
<p>
In this section, we review various alternatives and point out why they
are <i>not</i> literate programming in the strict sense of the word.
</p>
</div>
