comp-sci/literate-programming/whither.org
*** Docco
:PROPERTIES:
:CUSTOM_ID: h-9c07e10d-f7b5-4373-bfd3-75086c32c23d
:END:

Systems such as [[http://ashkenas.com/docco/][docco]] already do something superficially similar to
literate programming. docco is a way to present nicely formatted output
of comments, alongside or interspersed with source code. It not only
treats the comments as Markdown, meaning you can apply styles, but also
applies automatic syntax highlighting to your code. Underscore’s
[[https://underscorejs.org/docs/underscore.html][annotated source code]] is a classic, well-executed example of using
docco, which supports virtually any language. There are dozens of
variations of this product. It’s a great piece of work, but it’s not
literate programming, most basically because it’s missing the key
feature of re-ordering and transclusion.

*** Jupyter
:PROPERTIES:
:CUSTOM_ID: h-903c6781-ed3f-4b77-80b5-2fabf264eb23
:END:

What about systems like Jupyter, which provides a great notebook format
mixing narrative and code, with the added bonus that code can be
executed right in the “notebook”, with the output, including
visualizations, visible in real time? Although its roots are in the
Python world, Jupyter now supports other data-focused languages such as
R and Julia. But as wonderfully useful as Jupyter and similar systems,
such as [[http://beta.observablehq.com/][ObservableHQ]] (coming from the d3 world) are, and they are
becoming wildly popular as a way for data scientists to do and present
their work, we should distinguish them from literate programming. They
may contain little programs, but they are not intended to be a
programming system. The Wolfram Language (the language of Mathematica)
also appears to fall into this “live notebook” category.

*** JSDoc
:PROPERTIES:
:CUSTOM_ID: h-c90aa9b5-87a0-4457-b3f9-01cb4c6cd7b7
:END:

[[http://usejsdoc.org/][JSDoc]] is a documentation generation system designed to produce
self-standing documentations of interfaces and APIs. Virtually all other
languages have similar systems, including of course its ancestor
[[http://en.wikipedia.org/wiki/Javadoc][Javadoc]], JSDoc is great. There are other similar systems to do things
like auto-generating REST API documentation. But we can’t call these
literate programming. They are automated documentation generate tools.

*** Literate CoffeeScript and Literate Haskell
:PROPERTIES:
:CUSTOM_ID: h-5206c1ad-a465-4477-ae97-6ff2d4b90220
:END:

CoffeeScript offers a [[http://coffeescript.org/#literate][literate programming mode]], in which narrative
material is mixed with code (identified by being indented) in files with
the ~.literatecoffee~ extension. However, purists would say this is
nothing more than a syntactic alternative for comments, and that it
fails to meet the basic literate programming criteria of allowing the
author to re-order the program to present it in more human-friendly
fashion.

Haskell offers a well-regarded [[https://wiki.haskell.org/Literate_programming][literate programming mode]]. A tool called
[[https://wiki.haskell.org/Haddock][Haddock]] generates documentation from annotated source code. It offers
two solutions to the classic problem of how to distinguish narrative
from code when doing literate programming: “Bird notation”, where each
line of code is prefixed with a “>”, and LaTeX notation, where code is
surrounded by ~`~ , ~\begin{code}~ and ~\end{code}~ pairs (latex style); other
formatting unfortunately requires knowledge of LaTeX as well.

However, purists would again object to calling this feature, as useful
as it is, “literate programming”. They would point to the lack of any
ability to include fragments of code in other fragments, or the
full-fledged ability to present the code in a different order than it is
to be presented to the compiler.

For R aficionados, there is the ~sweave~ package — also LaTeX dependent —
and its successors, including [[https://github.com/yihui/knitr][knitr]]. And there are many others.

Currently, the only current tools that really qualify as literate
program in the strict Knuthian sense of the word are all quite long in
the tooth — for instance, [[https://en.wikipedia.org/wiki/Noweb][noweb]], a simplified 1990s port of [[https://en.wikipedia.org/wiki/CWEB][CWEB]] (a C
language version of Knuth’s original WEB system).

In the second part of this series, we will take up the question of why
literate programming has gotten so little traction over the decades. In
the third part we will move on to discussing future directions for
literate programming.

* Whither Literate Programming (2) — What went wrong?
:PROPERTIES:
:CUSTOM_ID: h-f3297cfd-2970-4f6d-8400-71c8f6e79063
:END:

What is literate programming? How has literate programming evolved? Why
hasn’t literate programming taken off? Where is it headed?

In the first article in this three part series, we addressed the first
of these questions, learning about what literate programming is,
something of its history, and the great promise it holds. Let us recall
the definition of literate programming:

#+begin_quote
Literate programming harmonizes the human and machine aspects of
programming into an integral whole which best expresses and communicates
a software solution.
#+end_quote

But something went horribly wrong. The Google Trends chart below shows
starkly the inexorable decline in interest in literate programming.

[graph omitted]

From a high point in 2004 — and remember that at this point a lot of the
air had already gone out of the literate programming balloon — interest
has declined to almost zero, relatively speaking.

What went wrong? That is the topic of this second article in our series
of literate programming.Let’s try to identify some of the causes of the
virtual complete lack of momentum in recent years. Some of these reasons
may be intrinsic to the activity of programming and programming behavior
in any era; others may have appeared, or been aggravated, by recent
changes in the environment.

Once we understand better what happened with literate programming, and
the factors affecting its adoption (or lack thereof), we will be ready
to propose a new generation of literate programming concepts and tools —
and a new series of use cases — which will finally allow us to realize
the potential of Knuth’s conceptual breakthrough. That will be the topic
of the third and final article in this series.

Now, with no further ado, let us proceed to examine the factors that
have slowed, and could continue to slow, the spread of literate
programming.

