docs/comp-sci/literate-programming/whither.html
<div id="outline-container-h-9c07e10d-f7b5-4373-bfd3-75086c32c23d" class="outline-4">
<h4 id="h-9c07e10d-f7b5-4373-bfd3-75086c32c23d"><span class="section-number-4">1.3.1.</span> Docco</h4>
<div class="outline-text-4" id="text-h-9c07e10d-f7b5-4373-bfd3-75086c32c23d">
<p>
Systems such as <a href="http://ashkenas.com/docco/">docco</a> already do something superficially similar to
literate programming. docco is a way to present nicely formatted output
of comments, alongside or interspersed with source code. It not only
treats the comments as Markdown, meaning you can apply styles, but also
applies automatic syntax highlighting to your code. Underscore’s
<a href="https://underscorejs.org/docs/underscore.html">annotated source code</a> is a classic, well-executed example of using
docco, which supports virtually any language. There are dozens of
variations of this product. It’s a great piece of work, but it’s not
literate programming, most basically because it’s missing the key
feature of re-ordering and transclusion.
</p>
</div>
</div>
<div id="outline-container-h-903c6781-ed3f-4b77-80b5-2fabf264eb23" class="outline-4">
<h4 id="h-903c6781-ed3f-4b77-80b5-2fabf264eb23"><span class="section-number-4">1.3.2.</span> Jupyter</h4>
<div class="outline-text-4" id="text-h-903c6781-ed3f-4b77-80b5-2fabf264eb23">
<p>
What about systems like Jupyter, which provides a great notebook format
mixing narrative and code, with the added bonus that code can be
executed right in the “notebook”, with the output, including
visualizations, visible in real time? Although its roots are in the
Python world, Jupyter now supports other data-focused languages such as
R and Julia. But as wonderfully useful as Jupyter and similar systems,
such as <a href="http://beta.observablehq.com/">ObservableHQ</a> (coming from the d3 world) are, and they are
becoming wildly popular as a way for data scientists to do and present
their work, we should distinguish them from literate programming. They
may contain little programs, but they are not intended to be a
programming system. The Wolfram Language (the language of Mathematica)
also appears to fall into this “live notebook” category.
</p>
</div>
</div>
<div id="outline-container-h-c90aa9b5-87a0-4457-b3f9-01cb4c6cd7b7" class="outline-4">
<h4 id="h-c90aa9b5-87a0-4457-b3f9-01cb4c6cd7b7"><span class="section-number-4">1.3.3.</span> JSDoc</h4>
<div class="outline-text-4" id="text-h-c90aa9b5-87a0-4457-b3f9-01cb4c6cd7b7">
<p>
<a href="http://usejsdoc.org/">JSDoc</a> is a documentation generation system designed to produce
self-standing documentations of interfaces and APIs. Virtually all other
languages have similar systems, including of course its ancestor
<a href="http://en.wikipedia.org/wiki/Javadoc">Javadoc</a>, JSDoc is great. There are other similar systems to do things
like auto-generating REST API documentation. But we can’t call these
literate programming. They are automated documentation generate tools.
</p>
</div>
</div>
<div id="outline-container-h-5206c1ad-a465-4477-ae97-6ff2d4b90220" class="outline-4">
<h4 id="h-5206c1ad-a465-4477-ae97-6ff2d4b90220"><span class="section-number-4">1.3.4.</span> Literate CoffeeScript and Literate Haskell</h4>
<div class="outline-text-4" id="text-h-5206c1ad-a465-4477-ae97-6ff2d4b90220">
<p>
CoffeeScript offers a <a href="http://coffeescript.org/#literate">literate programming mode</a>, in which narrative
material is mixed with code (identified by being indented) in files with
the <code>.literatecoffee</code> extension. However, purists would say this is
nothing more than a syntactic alternative for comments, and that it
fails to meet the basic literate programming criteria of allowing the
author to re-order the program to present it in more human-friendly
fashion.
</p>

<p>
Haskell offers a well-regarded <a href="https://wiki.haskell.org/Literate_programming">literate programming mode</a>. A tool called
<a href="https://wiki.haskell.org/Haddock">Haddock</a> generates documentation from annotated source code. It offers
two solutions to the classic problem of how to distinguish narrative
from code when doing literate programming: “Bird notation”, where each
line of code is prefixed with a “&gt;”, and LaTeX notation, where code is
surrounded by <code>`</code> , <code>\begin{code}</code> and <code>\end{code}</code> pairs (latex style); other
formatting unfortunately requires knowledge of LaTeX as well.
</p>

<p>
However, purists would again object to calling this feature, as useful
as it is, “literate programming”. They would point to the lack of any
ability to include fragments of code in other fragments, or the
full-fledged ability to present the code in a different order than it is
to be presented to the compiler.
</p>

<p>
For R aficionados, there is the <code>sweave</code> package — also LaTeX dependent —
and its successors, including <a href="https://github.com/yihui/knitr">knitr</a>. And there are many others.
</p>

<p>
Currently, the only current tools that really qualify as literate
program in the strict Knuthian sense of the word are all quite long in
the tooth — for instance, <a href="https://en.wikipedia.org/wiki/Noweb">noweb</a>, a simplified 1990s port of <a href="https://en.wikipedia.org/wiki/CWEB">CWEB</a> (a C
language version of Knuth’s original WEB system).
</p>

<p>
In the second part of this series, we will take up the question of why
literate programming has gotten so little traction over the decades. In
the third part we will move on to discussing future directions for
literate programming.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-h-f3297cfd-2970-4f6d-8400-71c8f6e79063" class="outline-2">
<h2 id="h-f3297cfd-2970-4f6d-8400-71c8f6e79063"><span class="section-number-2">2.</span> Whither Literate Programming (2) — What went wrong?</h2>
<div class="outline-text-2" id="text-h-f3297cfd-2970-4f6d-8400-71c8f6e79063">
<p>
What is literate programming? How has literate programming evolved? Why
hasn’t literate programming taken off? Where is it headed?
</p>

<p>
In the first article in this three part series, we addressed the first
of these questions, learning about what literate programming is,
something of its history, and the great promise it holds. Let us recall
the definition of literate programming:
</p>

<blockquote>
<p>
Literate programming harmonizes the human and machine aspects of
programming into an integral whole which best expresses and communicates
a software solution.
</p>
</blockquote>

<p>
But something went horribly wrong. The Google Trends chart below shows
starkly the inexorable decline in interest in literate programming.
</p>

<p>
[graph omitted]
</p>

<p>
From a high point in 2004 — and remember that at this point a lot of the
air had already gone out of the literate programming balloon — interest
has declined to almost zero, relatively speaking.
</p>

<p>
What went wrong? That is the topic of this second article in our series
of literate programming.Let’s try to identify some of the causes of the
virtual complete lack of momentum in recent years. Some of these reasons
may be intrinsic to the activity of programming and programming behavior
in any era; others may have appeared, or been aggravated, by recent
changes in the environment.
</p>

<p>
Once we understand better what happened with literate programming, and
the factors affecting its adoption (or lack thereof), we will be ready
to propose a new generation of literate programming concepts and tools —
and a new series of use cases — which will finally allow us to realize
the potential of Knuth’s conceptual breakthrough. That will be the topic
of the third and final article in this series.
</p>

<p>
Now, with no further ado, let us proceed to examine the factors that
have slowed, and could continue to slow, the spread of literate
programming.
</p>
</div>
