docs/comp-sci/literate-programming/whither.html
<div id="outline-container-h-0b6713f2-af64-4189-8507-5b5de0c041d6" class="outline-3">
<h3 id="h-0b6713f2-af64-4189-8507-5b5de0c041d6"><span class="section-number-3">2.1.</span> It solves problems that don’t need to be solved anymore</h3>
<div class="outline-text-3" id="text-h-0b6713f2-af64-4189-8507-5b5de0c041d6">
<p>
To understand the genesis of literate programming, and the reasons it
failed to catch on, let’s briefly review some historical background.
</p>

<p>
First, in 1984 there was no world-wide web or even really PCs for that
matter; “documentation” was printed on paper. Knuth, of course, was a
pioneer in computer-based typesetting with his TeX system, and so it is
not surprising that his initial implementation of literate programming
was designed to produce TeX documents. That meant, unfortunately, that
users had to know TeX to some extent, and that the source documents were
littered with incomprehensible TeX commands, so people had to write
things like this:
</p>

<p>
[picture omitted, presumably some straightforward TeX markup.]
</p>

<p>
Ouch.
</p>

<p>
Second, it turns out that at the time Knuth was programming in Pascal,
an early modern language that could be said to be based on ALGOL (the
progenitor of high-level structured programming languages), and was
later made famous by the ubiquitous Turbo Pascal. However, Pascal
imposed a number of limitations. For instance, it had no preprocessor or
<code>#define</code> like capability such as found in C; and it had restrictions on
things like the order of declarations. Knuth’s literate programming
initiative, which he called <code>WEB</code>, can be viewed in part as being a kind
of Pascal preprocessor to make up for these limitations.
</p>

<p>
Some critics of literate program say that modern programming
environments no longer have these kinds of issues, which has made
something like Knuth’s <code>WEB</code> less necessary. That’s just one of the many
criticisms of literate programming, which we go over in a following
section.
</p>
</div>
</div>
<div id="outline-container-h-cf3c2b25-b181-4205-ba41-742b5db5b197" class="outline-3">
<h3 id="h-cf3c2b25-b181-4205-ba41-742b5db5b197"><span class="section-number-3">2.2.</span> Literate programming is too much work and/or not necessary</h3>
<div class="outline-text-3" id="text-h-cf3c2b25-b181-4205-ba41-742b5db5b197">
<p>
Contrary to Knuth’s assertion in the quote given in the first article in
this series that literate programming lets him program faster, it’s a
fair assessment that adopting a literate programming approach might
actually require more time — in the worst case, perhaps as much as
double. Of course, the notion is that this extra investment of time will
repay itself many times over the coming years, by saving on maintenance
costs, or serving as great teaching material for new folks, but
unfortunately not only developers, but managers and business people as
well, tend to be more interested in how fast they can get something
working and shipped.
</p>
</div>
</div>
<div id="outline-container-h-adf8b1ca-44e4-4935-9be8-6d7dd267a16c" class="outline-3">
<h3 id="h-adf8b1ca-44e4-4935-9be8-6d7dd267a16c"><span class="section-number-3">2.3.</span> I don’t need no stinking comments</h3>
<div class="outline-text-3" id="text-h-adf8b1ca-44e4-4935-9be8-6d7dd267a16c">
<p>
This problem is aggravated by a particular mentality found in some
quarters of our industry that no kind of documentation, or comments, is
really necessary in the first place, because after, real developers
write “self-documenting code”, or in a variation of this line of
thought, real developers can figure out any code; some people say that
if you need to understand what code does you can just ask the person who
wrote it (if they’re still with the company, of course).
</p>

<p>
In its extreme incarnation, this mentality actually claims that comments
are evil and should be abolished. After all, why should I adorn a line
saying <code>initialize();</code> with a comment saying <code>// Initialize variables</code>?
These “antidocs” people variously claim that comments, in addition to
being superfluous, are subject to code rot — which of course they are,
unless someone keeps them up to date; that “wrong documentation is worse
than no documentation”; or that comments are actually a way of covering
up for poor coding practices, and in that sense may even indirectly
promote such poor coding practices, and on and on.
</p>

<p>
People who don’t believe in commenting their code are obviously not
going to be the least bit interested in literate programming, which can
be viewed as commenting on steroids. The prevalence of this attitude is
definitely a factor working against restoring any level of interest in
literate programming.
</p>
</div>
</div>
<div id="outline-container-h-9a403545-32fc-45c1-b99e-18532c065ae0" class="outline-3">
<h3 id="h-9a403545-32fc-45c1-b99e-18532c065ae0"><span class="section-number-3">2.4.</span> IDEs</h3>
<div class="outline-text-3" id="text-h-9a403545-32fc-45c1-b99e-18532c065ae0">
<p>
I personally believe that a lot of the blame for the demise of literate
programming can be laid at the feet of the folks making IDEs. As
programmers, we spend most of our time these days living inside
IDEs. We’ve gotten spoiled by their auto-complete features, in-line
error indications, and integrated build/run/debug features. We use them
for everything from downloading libraries to sending commands to our
phones to collaborative editing. Few if any programmers are going to
leave the warm embrace of their IDE and fire up a text editor to enter
cryptic commands in some literate programming language.
</p>

<p>
Yes, the IDEs do offer plug-ins. But in most cases, the plug-in
architecture does not expose the kind of functionality one would need to
implement literate programming in the IDE. If the IDE talks to some kind
of language service in the background, which reports syntax errors,
plugins may not be able to easily get their hands on that information in
order to display error annotations in the literate programming version
of the file.
</p>

<p>
Let’s be clear: there is no specific reason why IDEs could not offer
literate programming features. They simply don’t feel it’s a
priority. As a result, an entire generation of engineers has learned to
program in an environment where they couldn’t use literate programming
even if they wanted to. To be fair to the people making IDEs, there is a
chicken-and-egg problem here; they don’t want to provide a feature no
one is asking for, yet it is the very presence of the feature which
could help restore the popularity of literate programming popular.
</p>

<p>
Perhaps one problem is that the people building IDEs are confused about
what flavor of literate programming to implement. No one wants to go
back to Knuth’s arcane original notation, which lives on in
noweb. Certainly no one other than hold-outs in academia want to go
anywhere near literate programming that involves LaTeX. But the IDE
folks are smart and can figure this out. Markdown, or some variant
thereof, is a perfectly serviceable, widely-used format for textual
narrative, and in fact is already used in several of the few isolated
experiments on literate programming being done by zealots to this day;
for output, HTML is probably enough, but it’s not hard to also support
other formats such as <code>.doc</code>, <code>.pdf</code>, or even <code>.epub</code>, in case someone wants
to curl up in bed with your program.
</p>

<p>
VSCode, wherefore art thou?
</p>
</div>
</div>
