comp-sci/literate-programming/whither.org
** Tooling
:PROPERTIES:
:CUSTOM_ID: h-433ccf98-b471-4cfd-91ec-258b3a419a1c
:END:

By definition, literate programming requires an extra build step — the so-called “tangle” step of extracting and re-arranging the program code in the literate programming source into compilable or executable form. Although tangling usually involves nothing more than a quick command invocation, it is nevertheless yet another step to worry about and potentially go wrong — who wants today’s deployment to fail because of a lint error from some literate programming Markdown syntax?

In an era of source maps which allows us to map back compiled and transpiled code to the original source, or transformed CSS back to its pre-processor origins, there is a risk that we will be unable to map the code being executed back to the literate program we wrote — current approaches, such as they are, don’t address this issue at all.

Finally, it may be an issue that the tangling step also takes time; it should be quick, but every second counts.

Recent attempts to provide literate programming tools around the web
stack don’t really address these tooling issues in a convincing way.

** Literate revision management
:PROPERTIES:
:CUSTOM_ID: h-e0f4e384-0e7f-4f70-b3b1-0e63adae87c3
:END:

Knuth invented literate programming in the previous century. Although literate programming has many advantages that have withstood the test of time, there have also been massive changes in the computing world, some of which might make literate programming less pertinent. One of those is the advent of version control.

Knuth did not have any version control at all that we know of, much less “commit messages” or “pull requests”. Commit messages — if written carefully — can provide a useful kind of documentation for a system, with the added advantage that they are ordered chronologically, so the most recent ones come up first, with the older ones aging away gracefully. git and other version control systems can search commit messages, and we can find all the files involved in a particular commit whose message we have found.

This approach to consciously using commit messages for documentation has
been called “literate version control”. In addition to commit messages,
modern development methodologies, repository management systems, and
issue and bug tracking systems will capture code review comments and bug
discussions, all of which represent a kind of documentation, which has
the advantage almost by definition of being mostly about the things we
really care about. On the other hand, programmers who are not inclined
to comment their code, much less program in literal programming style,
are likely to also be the ones who write useless commit messages like
“Fixed bug”.

** Modern features in programming languages
:PROPERTIES:
:CUSTOM_ID: h-575501da-22db-4b61-a10b-ebda3548b6ae
:END:

As alluded to above, one of Knuth’s motivations in developing ~WEB~ was
the lack of macros in Pascal, and other language restrictions. Today’s
languages generally do provide macro or meta-programming
facilities. Chunks of code can be factored out into separate functions
within the parent function (in many languages, at least — actually this
was true for Pascal as well), and given meaningful names, with very low
run-time overhead — some engines may even inline them for you, and some
IDEs provide this kind of “refactoring” feature, so in this view there
is no need to rely on literate programming to manage our “chunks” for
us.

** Test-Driven Development
:PROPERTIES:
:CUSTOM_ID: h-d4f8f65a-725b-4f5e-918e-fbfb13bc1651
:END:

It’s safe to say that one key development in software over the last
decades has been a huge focus on testing, testing frameworks, testing
methodologies, and testing tools. We use the term “test-driven
development” here in its broadest sense — development which takes tests
seriously and devotes a meaningful amount of its time to developing and
maintaining tests. Literate programming has never provided a convincing
story about how it would co-exist with today’s test-centric priorities.

** Speed of change
:PROPERTIES:
:CUSTOM_ID: h-0258b0c0-1c9c-4f19-88ad-39437fea1529
:END:

As software developers, the world around us is changing much more
rapidly than ever before. Software can now be modified and deployed in
hours, rather than months or years. Our modern culture and business
environment has grown more dynamic, demanding that software change
faster to keep up. We no longer have the luxury of sitting in our
armchairs tweaking pixels and internal program structure. For literate
programming, the question is whether things are now moving too fast to
accommodate literate programming — or is literate programming actually a
savvy way to deal with the increased rate of change?

** Agility
:PROPERTIES:
:CUSTOM_ID: h-5cd1ac68-a2fa-403a-8f59-efd853925918
:END:

It’s now 2018, nearly two decades after the [[http://agilemanifesto.org/][Agile Manifesto]]. On the one
hand, that manifesto says

#+begin_quote
We are uncovering better ways of developing software by doing it and *helping others do it.*
#+end_quote

“Helping others do it” sure sounds like something that literate
programming could help with. And the twelve principles include:

#+begin_quote
Continuous attention to technical excellence and good design enhances agility.
#+end_quote

which definitely sounds like something that literate programming could
contribute to, since literate programming could certainly be considered
one aspect of “technical excellence”, and makes design explicit,
communicates it clearly, and facilitates peer review. On the other hand,
the manifesto goes on to say:

#+begin_quote
We have to come to value working software over *comprehensive documentation.*
#+end_quote

Depending on how you look at it, that could be taken as a criticism of
literate programming, to the extent you view it as “comprehensive
documention” which slows down getting to “working software”.

So which is it? Is agile supportive, not supportive, or indifferent to
literate programming? One insightful contributor to a [[https://news.ycombinator.com/item?id=10069748][Hacker News thread]]
from 2015 put it well:

#+begin_quote
I don’t think literate programming is incompatible with the original
agile manifesto, but I think it wouldn’t survive in what that seems to
have turned into.
#+end_quote

This article is not about justifying, or criticizing, or commenting on
the evolution of agile or scrum. Suffice it to say that moving toward
literate programming is almost certainly going to require a change in
mindset for the manager used to locking down features which are going to
get shipped next Tuesday or else, or getting evaluated on whether or not
they are shipped.

