comp-sci/literate-programming/whither.org
** The demise of program design
:PROPERTIES:
:CUSTOM_ID: h-c3b4a393-edb6-4e63-a8f5-64c5212ea32c
:END:

Literate programming is about expressing, and communicating program
design, in addition to individual pieces of code. (As such, it is also a
great way to share, review, and collaborate on designs.) By “program
design”, we refer to internal design — the structure of the modules and
components that make up the piece of solution, and their interfaces with
each other and the outside world.

Unfortunately, the past decades have seen an inexorable decline in the
practice of internal design. Far too many programmers these days believe
that the first step in software is to sit down right away in front of
the computer and start typing code, instead of first /thinking/, which is
what program design is about. It’s also hard to do too much thinking or
internal design when your manager is breathing down your neck about the
release next Tuesday. It’s hard to get into an internal design mentality
when none of your co-workers, or engineering managers who should know
better, care about it or even know how to do it. A generation of
programmers who have learned to program by copying and pasting fragments
of jQuery is not suddenly going to adopt an internal design mentality.

Literate programming has the potential to stand in an interesting
feedback loop with a revival in internal design. It can both benefit
from a greater focus on internal design; and by its very nature, can
contribute to that focus.

** A modular world
:PROPERTIES:
:CUSTOM_ID: h-073a1c5c-1f50-49fb-a39e-c4b2b458585a
:END:

In days of yore, monolithic programs were the rule, going all the way
back to the 1000-card deck of punched cards that made up your FORTRAN
program. Programming languages and development environments did not
support breaking systems down into modules, or communiation among
modules, at least not to the extend we know today. Literate programming
as we know it has never really addressed the modularization of the
world. How did individual literate programs relate to each other, or
refer to each other? Literate programs like TeX appear to have been
basically been one monstrous file, perhaps with simple inclusion
mechanisms, which when “woven” turned into the TeX book.

A successful, modern incarnation of literate programming is going to
have to fully support our current module-based world.

** Moving ahead
:PROPERTIES:
:CUSTOM_ID: h-fa9d0067-ebe4-42d0-a69f-c36761a2dace
:END:

This article has been about the reasons for literate programming not
taking off — some old reasons and some new reasons. However, I believe
that none of these barriers are impossible to overcome, and in fact that
we need literate programming today more than we ever had. In the next
installment in this series, I will present my scenarios for the future
of literate programming.

* Whither Literate Programming (3) — Desiderata for a New Era
:PROPERTIES:
:CUSTOM_ID: h-c7f91692-80ff-4392-9c2a-3c8f5d48c1fd
:END:

In the first article of this series, we reviewed the history of literate
programming. In the second article, we mused about how and why literate
programming never realized its immense promise. In that article, I
boldly promised a third article in the series which would 

#+begin_quote
…propose a new generation of literate programming concepts and tools —
and a new series of use cases — which will finally allow us to realize
the potential of Knuth’s conceptual breakthrough.
#+end_quote

However, I now see clearly that this ambitious enterprise cannot
possibly be realized in one additional article. A full rethinking of
literate programming might take a year, or a decade. It will require an
immense amount of conceptualization, invention, experimentation, and
development. So in this, the third article in the series, I will limit
myself to framing the problem, presenting the desiderata — the
requirements — for a new model and a new era of literate programming,
and provide the briefest of sketches of how we could move toward
satisfying them, in the form of a new medium I call a “litbook”, a
vastly enhanced type of ebook which is real-time, instrumented,
hyperconnected, and learning-equipped.

** What is literate programming?
:PROPERTIES:
:CUSTOM_ID: h-ad821979-f375-42ab-bb8a-f760bd1113e7
:END:

Let us start by reminding ourselves of Knuth’s incisive definition of
literate programming:

#+begin_quote
Literate programming harmonizes the human and machine aspects of
programming into an integral whole which best expresses and communicates
a software solution.
#+end_quote

This definition is notable for Knuth’s characteristically careful choice
of words, as well as the way in which it painstakingly abstracts away
any aspects of literate programming which were dependent on the
technologies or media of the time. It’s worth going over each word used
in this definition, with help from the dictionary:

*Harmonize.* “Combine in a pleasing fashion”; “coordinate”; “bring into alignment”; “blend”.

*Integral whole.* “A unit formed from the interrelated composition of all essential parts.”

*Express.* “Represent, such in words”; “give or convey”; “depict”.

*Communicate.* “Convey knowledge of or information about”.

