comp-sci/literate-programming/whither.org
** How must literate programming be reinvented?
:PROPERTIES:
:CUSTOM_ID: h-6f2438f9-d72d-42da-bf96-eb8c5d53b6ea
:END:

Knuth’s characterization of literate programming is so robust that in
and of itself it needs hardly any adjustment to our current reality
thirty-five years later. Twenty years into this bright new millennium,
we still — perhaps more than ever — want to express and communicate the
“human and machine aspects of our software solutions” as a harmonized,
integrated whole. The only differences worthy of note today are that
today our software solutions are more complex, and often composed from
sub-solutions, including third-party products. Contrast this with
something like TeX , for example, which was an almost entirely
stand-alone software system; this raises the question of what level of
granularity we should choose when creating works of literate
programming. We will revisit this topic later in the article.

If I were to quibble about Knuth’s formulation, it would be to wonder
why he stopped short of mentioning the /purpose/ of expressing and
communicating. I would be very surprised were it not the case that for
Knuth a major goal was simply to present a software solution in a way
enabling it to be appreciated for its intrinsic beauty, whether of
design or implementation; and, by extension, to pass on, directly or
indirectly, principles and techniques that could be used by
practitioners in the future. These remain admirable objectives for
literate programming to this day, at least within the academic, research
and education domains.

TeX, however, has essentially remain unchanged since v3 came out in
1989, when the character representation went to eight bits. (TeX has not
changed at all since v3.14159265, according to Knuth’s quirky
digits-of-pi-based versioning system, which came out in 2014; the next
revision, which will add another digit (3), is planned for 2020). Thus,
“TeX: The Program”, the literate programming version of TeX published in
1984, was only to a negligible extent about capturing information
required by maintainers. Today, in contrast, our systems tend to have
longer maintenance lifetimes, and thus the relative importance of
literate programming-like documents for purposes of teaching maintainers
the code has grown. Since there are presumably fewer people maintaining
a piece of software than wanting to understand its aesthetics, this also
implies that works of literate programming in our day are likely to have
smaller audiences.

In other words: in the 2020s, literate programming must re-orient itself
from being about museum catalogs describing beautiful, finished,
self-contained software objects, to be read in leisurely fashion,
towards being about guides to messy, tangled systems which are
undergoing ongoing development, targeting an audience with a decidedly
shorter attention span.

** A medium for literate programming for the 2020s
:PROPERTIES:
:CUSTOM_ID: h-0b6833fe-bc8d-49bf-bacb-c7735e20386f
:END:

It’s unlikely that Knuth considered any medium for his works of literate
programming other than the printed page, as he used for “TeX: The
Program” and “Metafont: The Program”. At the time, there would have been
few if any alternatives. And the physical book has massive advantages as
a medium for “expressing and communicating” information, which account
for its extraordinary durability as an artifact of our civilization,
dating back more than four thousand years. Those advantages include:

1. Books are discrete objects, which can be stored, carried around, given away, and their identity remembered.
2. Books typically cover a topic or tell a story in its entirety, in some depth.
3. Books provide a default path through the information, and it is very common to be useful to read a book from beginning to end.
4. Books can have indexes to quickly identify references to a particular topic.
5. Locations in books can be bookmarked.
6. Books often supply notes and/or bibliographies.

Most of these things would be highly useful, if not indispensable, in
any vehicle via which literate programming were to be delivered. After
all, if we consider that our objective is to “tell a story” about a
piece of software, what better medium than the classic storybook?

Aside from the heft of the printed volume and the distinctive smell of
the paper, we can now replicate most of the characteristics of books in
ebooks. Ebooks also offer the programmability necessary for things like
animations (although very few do). However, for reasons that may never
be fully elucidated, ebooks have failed to fully realize their potential
as the ubiquitous, self-contained, portable, digital containers of
information that many once hoped they would become. Most people today
probably think an ebook is the bastardized format you read on a Kindle,
and would not even know how to consume an EPUB if one fell into their
hands.

Notwithstanding the diminishing popularity of the ebook format, we think
it remains an excellent candidate for the vehicle via which to deliver
literate programming content, with certain key enhancements and
extensions. While preserving the strengths of the ebook format as we
know it, together with features already found in many ebooks such as
full-text search, hyperlinking of course, smart (e.g. animated) content,
and multiple navigational paths, we need to add the capability for
auto-updating, self-learning, instrumentation, and
personalization. Until someone comes up with a better name, let us call
this flavor of ebook a literate programming book, or litbook.

Litbooks must be tightly coupled to the repository and source code
control systems which are ubiquitous today. We also think it’s important
that they have advanced query mechanisms, and be intelligent in the
sense that they know, or can learn, what portions of the content are
most useful and what might be missing.

Critically, they must also be easily updatable in a semi-automated
fashion. Software solutions today not only have longer maintenance and
upgrade lifetimes, but are maintained and upgraded on a faster cadence —
much faster in many cases. And as we all know, the only thing worse than
no documentation is out-of-date documentation. Any model for literate
programming in the 2020’s must accommodate such rapid release
cycles. Just as we continuously integrate, and continuously deploy, we
must start to continuously document. In other words, in addition to CI
and CD we must have CL, meaning “continuous litbooking”. No feature or
subsystem should be considered complete until it is reflected in updated
works of a literate programming nature, any more than in today’s world a
feature or subsystem would be considered complete without accompanying
unit tests and/or integration tests.

Finally, it is imperative that our litbook approach avoid the “initial
cliff” — the inability to generate any useful literate programming
materials until program writers have made a specific investment of time
in preparing or writing litbook-specific content. We need to be able to
create litbooks from plain old software systems, using various
heuristics. This could be called “monotonic documentation” — meaning
that each incremental investment in litbooking provides in incrementally
more useful litbooks.

What approach would Knuth choose if he were to reinvent literate
programming today? How we would like to hear his input. Would it be
anything like the litbooks we have imagined here?
